In [1]:
import pandas as pd
import numpy as np

In [2]:
Table = { \
    'Customer-ID': [1, 2, 3, 4, 5], \
    'Names': [ \
        'Joe B. BARBY 12-05-2019', \
        'Juliette KARB 18-08-2018', \
        'Lucien VAN 05-07-2017', \
        'Danielle G. REB 03-09-2020', \
        'Lydia HAM 09-07-2018'], \
    'Gender': ['M', 'F', 'M', 'F', 'F'], \
    'Work-type': [1, 2, 2, 3, 3], \
    'Client-satisfaction': [3, 0, 4, 3, 5], \
    'Number-occupants': [2, 4, 2, 1, 2], \
    'Consumption': [70, 140, 65, 40, 65]}

TDF = pd.DataFrame(data = Table)

In [3]:
TDF

,Customer-ID,Names,Gender,Work-type,Client-satisfaction,Number-occupants,Consumption
0,1,Joe B. BARBY 12-05-2019,M,1,3,2,70
1,2,Juliette KARB 18-08-2018,F,2,0,4,140
2,3,Lucien VAN 05-07-2017,M,2,4,2,65
3,4,Danielle G. REB 03-09-2020,F,3,3,1,40
4,5,Lydia HAM 09-07-2018,F,3,5,2,65

In [4]:
TDF['First-Name'] = TDF.Names.str.split(" ").\
    map(lambda x: x[0])

TDF['Second-Name'] = TDF.Names.str.split(" ").\
    map(lambda x : x[-2])

TDF['Birth-Year'] = TDF.Names.\
    str.split("-", n =2, expand=True)[2]

In [5]:
TDF

,Customer-ID,Names,Gender,Work-type,Client-satisfaction,Number-occupants,Consumption,First-Name,Second-Name,Birth-Year
0,1,Joe B. BARBY 12-05-2019,M,1,3,2,70,Joe,BARBY,2019
1,2,Juliette KARB 18-08-2018,F,2,0,4,140,Juliette,KARB,2018
2,3,Lucien VAN 05-07-2017,M,2,4,2,65,Lucien,VAN,2017
3,4,Danielle G. REB 03-09-2020,F,3,3,1,40,Danielle,REB,2020
4,5,Lydia HAM 09-07-2018,F,3,5,2,65,Lydia,HAM,2018

In [6]:
dat_tidy = pd.DataFrame({'Customer-ID': [1, 2, 3], \
    'Gender': ['M', 'F', 'M']})
dat_non_tidy = pd.DataFrame(\
    {'Customer-ID': [1, 2, 3, 2, 3, 1],
     'Consumption': [70, 50, 65, 57, 69, 73]})

In [7]:
dat = dat_non_tidy.groupby('Customer-ID')['Consumption'].\
    agg(['sum'])

In [8]:
dat.columns = ['Sum-Consumption']

In [9]:
dat

             Sum-Consumption
Customer-ID
1                        143
2                        107
3                        134

In [12]:
dat = dat_tidy.merge(dat, left_on='Customer-ID', \
    right_index=True, how='left')

In [13]:
dat

   Customer-ID Gender  Sum-Consumption
0            1      M              143
1            2      F              107
2            3      M              134

In [14]:
print(dat)

   Customer-ID Gender  Sum-Consumption
0            1      M              143
1            2      F              107
2            3      M              134